Revit 2027 API
RevitLinkGraphicsSettings.LineWeights Property
 The line weights of RevitLinkGraphicsSettings. The line weights can be set to ByHostView or ByLinkView.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public LinkVisibility LineWeights { get; set; }
Public Property LineWeights As LinkVisibility
	Get
	Set
public:
property LinkVisibility LineWeights {
	LinkVisibility get ();
	void set (LinkVisibility value);
}
member LineWeights : LinkVisibility with get, set
Property Value
LinkVisibility
Exceptions
Exception | Condition
ArgumentException |  When setting this property: Disallowed LinkVisibility value.
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace